{
  "version": "1.0",
  "exportedAt": "2026-02-12T00:00:00.000Z",
  "deck": {
    "name": "Gaming Vocabulary",
    "description": "Essential English vocabulary for gamers — FPS, MOBA, RPG, streaming and online multiplayer.",
    "language": "en",
    "cards": [
      { "term": "AFK", "definition": "Away From Keyboard — temporarily not playing or responding", "context": "Don't go AFK during a ranked match." },
      { "term": "aggro", "definition": "aggressive play style, or the attention of enemies in a game", "context": "The tank needs to hold aggro so the healer can stay safe." },
      { "term": "aimbot", "definition": "a cheat program that automatically aims at opponents", "context": "That player got banned for using an aimbot." },
      { "term": "alpha", "definition": "an early, incomplete version of a game released for testing", "context": "The game is still in alpha, so expect lots of bugs." },
      { "term": "AOE", "definition": "Area of Effect — an ability that affects a zone rather than a single target", "context": "Use your AOE spell to hit all the enemies grouped together." },
      { "term": "backlog", "definition": "the list of games you own but haven't played yet", "context": "My Steam backlog has over 200 games." },
      { "term": "ban", "definition": "to block a player or character from being selected or from playing", "context": "He got a permanent ban for toxic behavior." },
      { "term": "beta", "definition": "a near-complete version of a game released for wider testing", "context": "We got early access to the beta last weekend." },
      { "term": "bot", "definition": "a computer-controlled character in a game", "context": "The lobby was full of bots instead of real players." },
      { "term": "buff", "definition": "a positive effect that strengthens a character, or a game update that makes something stronger", "context": "The developers buffed the shotgun in the latest patch." },
      { "term": "build", "definition": "a specific combination of skills, gear, or stats for a character", "context": "I'm running a strength build for this playthrough." },
      { "term": "camp", "definition": "to stay in one spot and wait for enemies to come to you", "context": "Stop camping in the corner with a sniper rifle!" },
      { "term": "carry", "definition": "a player who leads the team to victory through strong performance", "context": "She carried the whole team with 30 kills." },
      { "term": "casual", "definition": "a player who games for fun without focusing on competition", "context": "I'm just a casual player; I don't do ranked." },
      { "term": "cheese", "definition": "an easy or exploitative strategy that feels unfair", "context": "That cheese strategy won't work against experienced players." },
      { "term": "clan", "definition": "an organized group of players who play together regularly", "context": "Our clan has been competing in tournaments for two years." },
      { "term": "clutch", "definition": "winning a round or fight in a critical, high-pressure moment", "context": "He pulled off an incredible clutch in the final round." },
      { "term": "co-op", "definition": "cooperative mode where players work together instead of against each other", "context": "This game is more fun in co-op with friends." },
      { "term": "cooldown", "definition": "the waiting time before an ability can be used again", "context": "My ultimate has a 90-second cooldown." },
      { "term": "crafting", "definition": "the process of creating items or gear from collected materials", "context": "You need iron ore and wood for crafting a sword." },
      { "term": "crosshair", "definition": "the aiming reticle in the center of the screen", "context": "I changed my crosshair to a small green dot." },
      { "term": "crossplay", "definition": "the ability for players on different platforms to play together", "context": "This game supports crossplay between PC and console." },
      { "term": "DLC", "definition": "Downloadable Content — additional content released after the main game", "context": "The new DLC adds three more maps and a story expansion." },
      { "term": "DPS", "definition": "Damage Per Second — a measure of how much damage a character deals over time", "context": "The mage has the highest DPS on the team." },
      { "term": "drop", "definition": "a rare item that appears when defeating an enemy, or a landing spot in battle royale", "context": "I finally got the legendary drop after 50 runs." },
      { "term": "dungeon", "definition": "a confined area filled with enemies and challenges, usually with a boss at the end", "context": "We spent two hours clearing the dungeon." },
      { "term": "early access", "definition": "a release model where players can buy and play a game before it's finished", "context": "The game launched in early access last month." },
      { "term": "Easter egg", "definition": "a hidden secret or reference placed in a game by the developers", "context": "There's a cool Easter egg if you visit the cave at midnight." },
      { "term": "emote", "definition": "an in-game animation or gesture a character performs", "context": "He did a dance emote after winning the match." },
      { "term": "endgame", "definition": "the content or activities available after completing the main story", "context": "The endgame grind for gear keeps players coming back." },
      { "term": "exploit", "definition": "a bug or unintended mechanic used to gain an unfair advantage", "context": "Players found an exploit to duplicate items." },
      { "term": "farm", "definition": "to repeatedly do the same action to collect resources or experience", "context": "I need to farm gold before I can buy the upgrade." },
      { "term": "FPS", "definition": "First-Person Shooter, or Frames Per Second depending on context", "context": "The game runs at 120 FPS on my new graphics card." },
      { "term": "frag", "definition": "a kill in a shooter game", "context": "He got 25 frags in a single round." },
      { "term": "gank", "definition": "to ambush or surprise-attack an enemy player, often with numerical advantage", "context": "Three players ganked me while I was farming alone." },
      { "term": "GG", "definition": "Good Game — said at the end of a match as a sign of sportsmanship", "context": "GG, that was a really close match!" },
      { "term": "glitch", "definition": "a bug or error in the game that causes unexpected behavior", "context": "There's a glitch that lets you walk through walls." },
      { "term": "griefer", "definition": "a player who intentionally ruins the experience for others", "context": "A griefer kept team-killing us the whole match." },
      { "term": "grind", "definition": "repetitive gameplay to earn rewards or level up", "context": "The grind to max level takes about 100 hours." },
      { "term": "guild", "definition": "an organized group of players in an MMO or RPG", "context": "Our guild cleared the raid on the first attempt." },
      { "term": "headshot", "definition": "hitting an enemy in the head for extra damage", "context": "A headshot with the sniper is an instant elimination." },
      { "term": "heal", "definition": "to restore a character's health points", "context": "The support player needs to heal the tank." },
      { "term": "hitbox", "definition": "the invisible area around a character that registers hits", "context": "The hitbox on that character feels way too big." },
      { "term": "HP", "definition": "Health Points — the amount of damage a character can take before being eliminated", "context": "I'm down to 10 HP, I need a health potion." },
      { "term": "HUD", "definition": "Heads-Up Display — the on-screen interface showing health, ammo, minimap, etc.", "context": "You can customize the HUD in the settings menu." },
      { "term": "indie", "definition": "a game developed by a small studio without major publisher backing", "context": "Some of the best games this year are indie titles." },
      { "term": "KD", "definition": "Kill/Death ratio — the number of kills divided by deaths", "context": "My KD this season is 1.8." },
      { "term": "kite", "definition": "to keep distance from an enemy while attacking them", "context": "Kite the boss around the arena to avoid his melee attacks." },
      { "term": "lag", "definition": "delay between a player's action and the game's response, caused by network issues", "context": "I died because of lag, my shots weren't registering." },
      { "term": "lane", "definition": "a main path on a MOBA map where minions and players fight", "context": "I'm going to the top lane this match." },
      { "term": "leaderboard", "definition": "a ranking system that shows the top players or teams", "context": "She's in the top 100 on the global leaderboard." },
      { "term": "level up", "definition": "to gain enough experience to increase your character's level", "context": "I need 500 more XP to level up." },
      { "term": "loot", "definition": "items, gear, or resources collected in a game", "context": "The boss dropped some amazing loot." },
      { "term": "loot box", "definition": "a purchasable or earnable container with random in-game items", "context": "I opened 10 loot boxes and got nothing good." },
      { "term": "main", "definition": "the character or class a player uses most often", "context": "I main the healer in every multiplayer game." },
      { "term": "matchmaking", "definition": "the system that pairs players together for online matches", "context": "The matchmaking put us against a team way above our skill level." },
      { "term": "meta", "definition": "the most effective strategy, character, or loadout at a given time", "context": "The current meta favors aggressive rush compositions." },
      { "term": "MMO", "definition": "Massively Multiplayer Online — a game with a large number of players in a shared world", "context": "World of Warcraft is one of the most famous MMOs." },
      { "term": "mob", "definition": "a non-player enemy in a game, especially in RPGs", "context": "Clear the mobs before engaging the boss." },
      { "term": "mod", "definition": "a user-created modification that changes or adds to a game", "context": "I installed a mod that adds new weapons and quests." },
      { "term": "nerf", "definition": "a game update that makes a character, weapon, or ability weaker", "context": "They nerfed the assault rifle; it does less damage now." },
      { "term": "NPC", "definition": "Non-Player Character — a character controlled by the game, not a human", "context": "Talk to the NPC near the market to get the quest." },
      { "term": "noob", "definition": "a new or inexperienced player", "context": "Don't be mean to noobs, everyone starts somewhere." },
      { "term": "OP", "definition": "Overpowered — too strong compared to everything else", "context": "That new weapon is completely OP; it needs a nerf." },
      { "term": "open world", "definition": "a game design where the player can explore freely without linear restrictions", "context": "The open world map is huge with hundreds of side quests." },
      { "term": "party", "definition": "a group of players teamed up for a game session", "context": "Invite me to your party so we can play together." },
      { "term": "patch", "definition": "a game update that fixes bugs or changes features", "context": "The new patch fixed the crashing issue on startup." },
      { "term": "permadeath", "definition": "a game mechanic where death is permanent and progress is lost", "context": "Permadeath makes every decision feel incredibly tense." },
      { "term": "ping", "definition": "a measure of network latency in milliseconds, or a map marker to communicate with teammates", "context": "My ping is 15ms, so the connection feels smooth." },
      { "term": "PvE", "definition": "Player versus Environment — gameplay against computer-controlled enemies", "context": "I prefer PvE content like dungeons and raids." },
      { "term": "PvP", "definition": "Player versus Player — gameplay against other human players", "context": "The PvP arena is where the real competition happens." },
      { "term": "rage quit", "definition": "to leave a game abruptly out of frustration", "context": "He rage quit after losing three rounds in a row." },
      { "term": "raid", "definition": "a large-scale cooperative challenge requiring a group of players", "context": "The raid requires six players and takes about three hours." },
      { "term": "ranked", "definition": "a competitive mode where wins and losses affect your skill rating", "context": "I only play ranked when I'm warmed up." },
      { "term": "re-spec", "definition": "to reset and reassign a character's skills or stats", "context": "I need to re-spec my character for the new meta." },
      { "term": "respawn", "definition": "to come back to life at a designated point after being eliminated", "context": "You respawn after a 10-second timer." },
      { "term": "RNG", "definition": "Random Number Generator — the randomness that determines loot drops, critical hits, etc.", "context": "RNG was not on my side today; I got zero rare drops." },
      { "term": "roguelike", "definition": "a genre with procedurally generated levels and permadeath", "context": "Hades is one of the best roguelike games ever made." },
      { "term": "rotation", "definition": "the optimal order to use abilities, or moving between zones on a map", "context": "Learn the ability rotation to maximize your damage output." },
      { "term": "rush", "definition": "to move quickly toward an objective or enemy position", "context": "Let's rush B site before they can set up defenses." },
      { "term": "sandbox", "definition": "a game style that gives players freedom to create and experiment", "context": "Minecraft is the most popular sandbox game in history." },
      { "term": "save file", "definition": "stored game progress that can be loaded later", "context": "I lost my save file and had to start over." },
      { "term": "scope", "definition": "the magnifying sight attached to a weapon for long-range aiming", "context": "I put a 4x scope on my sniper for better accuracy." },
      { "term": "season", "definition": "a timed period in a live-service game with new content and rewards", "context": "Season 5 starts next week with a new battle pass." },
      { "term": "skin", "definition": "a cosmetic item that changes the appearance of a character or weapon", "context": "I bought a rare skin for my favorite character." },
      { "term": "smurfing", "definition": "a skilled player using a low-ranked account to play against weaker opponents", "context": "That guy is definitely smurfing; no way he's a beginner." },
      { "term": "spawn", "definition": "the location where a player or item appears in the game", "context": "The enemies spawn on the other side of the map." },
      { "term": "speedrun", "definition": "completing a game as fast as possible, often using advanced techniques", "context": "The world record speedrun for this game is under 15 minutes." },
      { "term": "stack", "definition": "a group of friends queuing together, or an effect that accumulates", "context": "We ran a five-stack and won every match." },
      { "term": "strat", "definition": "short for strategy — a planned approach to a game situation", "context": "What's the strat for the second round?" },
      { "term": "stream", "definition": "to broadcast gameplay live to an audience", "context": "I'm going to stream for a few hours tonight on Twitch." },
      { "term": "streamer", "definition": "a person who broadcasts their gameplay live for viewers", "context": "My favorite streamer plays competitive shooters every day." },
      { "term": "tank", "definition": "a character role focused on absorbing damage and protecting teammates", "context": "We need a tank to take the hits for the team." },
      { "term": "teamfight", "definition": "a large fight involving most or all members of both teams", "context": "We won the teamfight and pushed to their base." },
      { "term": "tilt", "definition": "a state of frustration that negatively affects gameplay", "context": "I'm on tilt after losing five games in a row." },
      { "term": "toxic", "definition": "rude, hostile, or negative behavior from a player", "context": "The chat was so toxic that I had to mute everyone." },
      { "term": "trade", "definition": "exchanging items with another player, or getting a kill right after dying", "context": "We traded kills and both teams were down one player." },
      { "term": "tutorial", "definition": "an introductory section of a game that teaches the basic controls and mechanics", "context": "Don't skip the tutorial if it's your first time playing." },
      { "term": "tryhard", "definition": "a player who puts maximum effort into winning, sometimes used negatively", "context": "It's just a casual match; no need to be a tryhard." },
      { "term": "ult", "definition": "short for ultimate — the most powerful ability a character has", "context": "Save your ult for the next teamfight." },
      { "term": "wallhack", "definition": "a cheat that allows players to see through walls", "context": "That player is using wallhacks; he always knows where we are." },
      { "term": "wipe", "definition": "when an entire team is eliminated, or when progress is reset", "context": "They wiped our whole squad in under ten seconds." },
      { "term": "XP", "definition": "Experience Points — points earned that contribute to leveling up", "context": "You get bonus XP for completing the daily challenges." }
    ]
  }
}
