{
  "version": "1.0",
  "exportedAt": "2026-02-11T00:00:00.000Z",
  "deck": {
    "name": "IT & Computer Science",
    "description": "Essential vocabulary for software development, networking, cybersecurity and computer science.",
    "language": "en",
    "cards": [
      { "term": "algorithm", "definition": "a step-by-step procedure for solving a problem or performing a task", "context": "The sorting algorithm runs in O(n log n) time." },
      { "term": "API", "definition": "Application Programming Interface — a set of rules that allows programs to communicate with each other", "context": "We use a REST API to fetch data from the server." },
      { "term": "backend", "definition": "the server-side part of an application that handles logic, databases and authentication", "context": "The backend is built with Node.js and Express." },
      { "term": "frontend", "definition": "the client-side part of an application that the user interacts with directly", "context": "The frontend uses React to render the UI." },
      { "term": "bug", "definition": "an error or flaw in a program that causes it to behave unexpectedly", "context": "We found a critical bug in the payment module." },
      { "term": "cache", "definition": "a hardware or software component that stores data so future requests are served faster", "context": "The browser cache reduces page load time." },
      { "term": "cloud computing", "definition": "delivery of computing services over the internet instead of local hardware", "context": "We migrated our infrastructure to cloud computing." },
      { "term": "compiler", "definition": "a program that translates source code into machine code before execution", "context": "The C++ compiler detected a syntax error on line 42." },
      { "term": "CPU", "definition": "Central Processing Unit — the main chip that executes instructions in a computer", "context": "The CPU usage spiked to 100% during the benchmark." },
      { "term": "database", "definition": "an organized collection of structured data stored and accessed electronically", "context": "User accounts are stored in a PostgreSQL database." },
      { "term": "debugging", "definition": "the process of finding and fixing errors in code", "context": "Debugging took longer than writing the feature." },
      { "term": "deployment", "definition": "the process of releasing software to a production environment", "context": "We automate deployment using a CI/CD pipeline." },
      { "term": "DNS", "definition": "Domain Name System — translates domain names into IP addresses", "context": "The DNS server resolved example.com to 93.184.216.34." },
      { "term": "encryption", "definition": "the process of converting data into a coded format to prevent unauthorized access", "context": "All passwords are protected with AES-256 encryption." },
      { "term": "endpoint", "definition": "a specific URL where an API receives requests", "context": "The /users endpoint returns a list of all registered users." },
      { "term": "firewall", "definition": "a network security system that monitors and controls incoming and outgoing traffic", "context": "The firewall blocked the suspicious connection attempt." },
      { "term": "framework", "definition": "a reusable set of libraries and tools that provides a structure for building software", "context": "React Native is a popular framework for mobile apps." },
      { "term": "full-stack", "definition": "a developer or role covering both frontend and backend development", "context": "She works as a full-stack developer using Next.js." },
      { "term": "function", "definition": "a reusable block of code that performs a specific task", "context": "This function calculates the total price including tax." },
      { "term": "Git", "definition": "a distributed version control system used to track changes in source code", "context": "We use Git to collaborate and manage branches." },
      { "term": "HTTP", "definition": "HyperText Transfer Protocol — the foundation of data communication on the web", "context": "The browser sends an HTTP GET request to load the page." },
      { "term": "IDE", "definition": "Integrated Development Environment — a software suite for writing, testing and debugging code", "context": "VS Code is one of the most popular IDEs today." },
      { "term": "iteration", "definition": "a single pass through a set of instructions in a loop", "context": "Each iteration of the loop processes one item in the array." },
      { "term": "JSON", "definition": "JavaScript Object Notation — a lightweight data-interchange format", "context": "The API returns data in JSON format." },
      { "term": "kernel", "definition": "the core part of an operating system that manages hardware and system resources", "context": "The Linux kernel handles memory allocation and process scheduling." },
      { "term": "latency", "definition": "the time delay between a request and the corresponding response", "context": "Low latency is critical for real-time multiplayer games." },
      { "term": "library", "definition": "a collection of pre-written code that developers can use to perform common tasks", "context": "We imported a date library to handle time zones." },
      { "term": "localhost", "definition": "a hostname that refers to the current computer, usually resolving to 127.0.0.1", "context": "The dev server is running on localhost:3000." },
      { "term": "malware", "definition": "malicious software designed to damage or gain unauthorized access to a system", "context": "The antivirus detected malware in the downloaded file." },
      { "term": "merge conflict", "definition": "a situation in version control where two changes to the same file cannot be automatically combined", "context": "We resolved the merge conflict before pushing to main." },
      { "term": "middleware", "definition": "software that sits between the OS and applications, or between request and response in a server", "context": "The authentication middleware checks the JWT token." },
      { "term": "module", "definition": "a self-contained unit of code that can be imported and reused", "context": "Each feature is organized as a separate module." },
      { "term": "network", "definition": "a group of interconnected computers that can share data and resources", "context": "The office network supports up to 200 devices." },
      { "term": "OOP", "definition": "Object-Oriented Programming — a paradigm based on classes, objects, inheritance and encapsulation", "context": "Java is a language that heavily uses OOP principles." },
      { "term": "open source", "definition": "software whose source code is freely available for anyone to view, modify and distribute", "context": "Linux is the most well-known open source operating system." },
      { "term": "operating system", "definition": "system software that manages hardware and provides services for applications", "context": "Windows, macOS and Linux are popular operating systems." },
      { "term": "package manager", "definition": "a tool that automates installing, updating and removing software packages", "context": "We use npm as the package manager for our JavaScript project." },
      { "term": "port", "definition": "a numbered endpoint for network communication on a host", "context": "The web server listens on port 443 for HTTPS." },
      { "term": "protocol", "definition": "a set of rules that governs how data is transmitted over a network", "context": "HTTPS is a secure protocol for web communication." },
      { "term": "pull request", "definition": "a proposal to merge code changes from one branch into another, allowing review", "context": "Please open a pull request so we can review your changes." },
      { "term": "query", "definition": "a request for data from a database or search engine", "context": "The SQL query returned 1,500 matching records." },
      { "term": "RAM", "definition": "Random Access Memory — temporary storage that the CPU uses for active tasks", "context": "The application requires at least 8 GB of RAM." },
      { "term": "refactoring", "definition": "restructuring existing code without changing its external behavior", "context": "We spent a sprint refactoring the authentication module." },
      { "term": "repository", "definition": "a central location where code and its history are stored", "context": "Clone the repository from GitHub to start contributing." },
      { "term": "responsive design", "definition": "a web design approach that makes pages render well on different screen sizes", "context": "Responsive design ensures the site looks good on mobile." },
      { "term": "runtime", "definition": "the period during which a program is executing, or the environment that runs it", "context": "Node.js is a JavaScript runtime built on Chrome's V8 engine." },
      { "term": "SaaS", "definition": "Software as a Service — a model where software is hosted in the cloud and accessed via subscription", "context": "Slack and Google Workspace are popular SaaS products." },
      { "term": "scalability", "definition": "the ability of a system to handle increasing workload without losing performance", "context": "We designed the architecture with scalability in mind." },
      { "term": "SDK", "definition": "Software Development Kit — a set of tools for building applications for a specific platform", "context": "The Android SDK includes an emulator and build tools." },
      { "term": "server", "definition": "a computer or program that provides services or resources to other computers on a network", "context": "The server handles thousands of requests per second." },
      { "term": "SQL", "definition": "Structured Query Language — a language for managing and querying relational databases", "context": "She wrote an SQL query to join the users and orders tables." },
      { "term": "SSH", "definition": "Secure Shell — a protocol for securely connecting to a remote machine over a network", "context": "I connected to the production server via SSH." },
      { "term": "stack overflow", "definition": "an error that occurs when a program uses more call stack memory than is available", "context": "The recursive function caused a stack overflow." },
      { "term": "syntax", "definition": "the set of rules that defines the correct structure of code in a programming language", "context": "Python uses indentation as part of its syntax." },
      { "term": "terminal", "definition": "a text-based interface for interacting with the operating system through commands", "context": "Open a terminal and run npm install." },
      { "term": "testing", "definition": "the process of evaluating software to find defects and ensure quality", "context": "Unit testing covers individual functions in isolation." },
      { "term": "thread", "definition": "the smallest unit of execution within a process", "context": "The app uses multiple threads to handle requests concurrently." },
      { "term": "token", "definition": "a piece of data that represents authorization or identity", "context": "The JWT token expires after 24 hours." },
      { "term": "TypeScript", "definition": "a typed superset of JavaScript that compiles to plain JavaScript", "context": "We use TypeScript to catch type errors at compile time." },
      { "term": "UI", "definition": "User Interface — the visual elements through which a user interacts with an application", "context": "The UI was redesigned to improve accessibility." },
      { "term": "UX", "definition": "User Experience — the overall experience a person has when using a product", "context": "Good UX reduces friction and increases user retention." },
      { "term": "variable", "definition": "a named storage location in memory that holds a value", "context": "Declare the variable with let if its value will change." },
      { "term": "version control", "definition": "a system that records changes to files over time so you can recall specific versions", "context": "Version control lets us revert to any previous state of the code." },
      { "term": "virtual machine", "definition": "a software emulation of a physical computer that runs its own operating system", "context": "We run the test suite inside a virtual machine." },
      { "term": "VPN", "definition": "Virtual Private Network — creates an encrypted connection over a less secure network", "context": "Use the company VPN to access internal resources remotely." },
      { "term": "webhook", "definition": "an HTTP callback that sends real-time data to other applications when an event occurs", "context": "The payment provider sends a webhook when a transaction completes." },
      { "term": "CI/CD", "definition": "Continuous Integration / Continuous Deployment — practices for automating build, test and release", "context": "Our CI/CD pipeline runs tests on every pull request." },
      { "term": "container", "definition": "a lightweight, standalone package that includes everything needed to run a piece of software", "context": "We deploy each microservice as a Docker container." },
      { "term": "microservice", "definition": "an architectural style where an application is composed of small, independent services", "context": "Each microservice handles a single business capability." },
      { "term": "abstraction", "definition": "hiding complex implementation details behind a simpler interface", "context": "Good abstraction makes the codebase easier to maintain." },
      { "term": "bandwidth", "definition": "the maximum rate of data transfer across a network path", "context": "Video streaming requires high bandwidth." },
      { "term": "boolean", "definition": "a data type that can only be true or false", "context": "The function returns a boolean indicating success." },
      { "term": "byte", "definition": "a unit of digital information equal to 8 bits", "context": "A single ASCII character takes up one byte." },
      { "term": "class", "definition": "a blueprint for creating objects in object-oriented programming", "context": "The User class defines properties like name and email." },
      { "term": "CLI", "definition": "Command Line Interface — a text-based interface for running programs and commands", "context": "Use the CLI to scaffold a new project." },
      { "term": "dependency", "definition": "an external library or module that a project requires to function", "context": "We updated all dependencies to their latest versions." },
      { "term": "DevOps", "definition": "a set of practices that combines development and operations to shorten the release cycle", "context": "The DevOps team automated the entire deployment pipeline." },
      { "term": "hash", "definition": "a fixed-size value computed from input data, used for integrity checks or indexing", "context": "Passwords are stored as bcrypt hashes in the database." },
      { "term": "inheritance", "definition": "an OOP mechanism where a class derives properties and methods from a parent class", "context": "The Admin class uses inheritance to extend the User class." },
      { "term": "IP address", "definition": "a numerical label assigned to each device connected to a computer network", "context": "The server's IP address is 192.168.1.10." },
      { "term": "linter", "definition": "a tool that analyzes code for potential errors and style violations", "context": "The linter flagged an unused variable on line 17." },
      { "term": "payload", "definition": "the actual data carried in a network request or message", "context": "The POST request includes a JSON payload with user details." },
      { "term": "regex", "definition": "Regular Expression — a pattern used to match and manipulate strings", "context": "We use a regex to validate email addresses." },
      { "term": "render", "definition": "to generate and display visual output on the screen", "context": "React re-renders the component when state changes." },
      { "term": "REST", "definition": "Representational State Transfer — an architectural style for designing networked APIs", "context": "The REST API exposes CRUD operations for each resource." },
      { "term": "router", "definition": "a device or module that directs data packets between networks or application routes", "context": "The Express router maps URLs to controller functions." },
      { "term": "schema", "definition": "the structure or blueprint that defines how data is organized in a database", "context": "The database schema includes tables for users, posts, and comments." },
      { "term": "scope", "definition": "the region of code where a variable is accessible", "context": "Variables declared with let have block scope." },
      { "term": "singleton", "definition": "a design pattern that restricts a class to a single instance", "context": "The database connection pool is implemented as a singleton." },
      { "term": "sprint", "definition": "a fixed time period in Agile during which specific work must be completed", "context": "We plan two features for each two-week sprint." },
      { "term": "SSL/TLS", "definition": "protocols that provide encrypted communication over a network", "context": "The website uses SSL/TLS to protect user data in transit." },
      { "term": "stack", "definition": "a data structure that follows Last-In-First-Out order; also refers to a technology stack", "context": "Our tech stack includes React, Node.js, and PostgreSQL." },
      { "term": "state", "definition": "the current condition or data of an application or component at a given time", "context": "The component re-renders whenever its state changes." },
      { "term": "string", "definition": "a sequence of characters used to represent text in programming", "context": "The function takes a string parameter and returns its length." },
      { "term": "tuple", "definition": "an ordered, immutable collection of elements", "context": "The function returns a tuple of the x and y coordinates." },
      { "term": "type safety", "definition": "the extent to which a language prevents type errors", "context": "TypeScript provides type safety by checking types at compile time." },
      { "term": "URL", "definition": "Uniform Resource Locator — the address used to access a resource on the web", "context": "Enter the URL in your browser to visit the website." },
      { "term": "authentication", "definition": "the process of verifying the identity of a user or system", "context": "Authentication is handled via OAuth 2.0 tokens." },
      { "term": "authorization", "definition": "the process of determining what an authenticated user is allowed to do", "context": "Authorization rules restrict admin pages to staff only." }
    ]
  }
}
